/*****************************************************************************
* 文件名：iic.c
* 说  明：操作IIC串行通信芯片的基本函数
*****************************************************************************/

#include "main.h"

sbit SDA = P2^0;
sbit SCL = P2^1;

/******************************************************
* 函  数：短暂延时函数，大概12um
* 参  数：空
* 返回值：无
******************************************************/
void delay(void)
{
	_nop_();_nop_();
	_nop_();_nop_();
	_nop_();_nop_();
//	_nop_();_nop_();
}

/******************************************************
* 函  数：初始化IIC
* 参  数：空
* 返回值：无
******************************************************/
void init_IIC(void)
{
	SDA = 1;
	delay();
	SCL = 1;
	delay();
}

/******************************************************
* 函  数：IIC起始信号
* 参  数：空
* 返回值：无
******************************************************/
void start(void)
{
	SDA = 1;
	delay();
	SCL = 1;
	delay();
	SDA = 0;
	delay();
}

/******************************************************
* 函  数：IIC终止信号
* 参  数：空
* 返回值：无
******************************************************/
void stop(void)
{
	SDA = 0;
	delay();
	SCL = 1;
	delay();
	SDA = 1;
	delay();
}

/******************************************************
* 函  数：IIC ACK应答信号
* 参  数：空
* 返回值：无
******************************************************/
void ack(void)
{
	uchar i=0;
	SCL = 1;
	delay();
	while((SDA==1)&&(i<250))
	{
		i++;
	}
	SCL = 0;
	delay();
}

/******************************************************
* 函  数：IIC NOACK应答信号
* 参  数：空
* 返回值：无
******************************************************/
void noack(void)
{
	SDA = 1;
	delay();
	SCL = 1;
	delay();
	SCL = 0;
	delay();
}

/******************************************************
* 函  数：IIC 写数据
* 参  数：dat要写的数据
* 返回值：无
******************************************************/
void IIC_write_byte(uchar dat)
{
	uchar i,tmp;
	tmp = dat;
	for(i=0;i<8;i++)
	{
		SCL = 0;
		delay();
		if(tmp&0x80)
		{
			SDA = 1;
		}
		else
		{
			SDA = 0;
		}
		tmp = tmp<<1;
		delay();
		SCL = 1;
		delay();
	}
	SCL = 0;
	delay();
	SDA = 1;
	delay();	
}

/******************************************************
* 函  数：IIC 读数据
* 参  数：空
* 返回值：dat读取到的数据
******************************************************/
uchar IIC_read_byte(void)
{
	uchar i,dat;
	SCL = 0;
	delay();
	SDA = 1;
	delay();
	for(i=0;i<8;i++)
	{
		SCL = 1;
		delay();
		dat = dat<<1;
		if(SDA)
		{
			dat++;
		}
		SCL = 0;
		delay();
	}
	return dat;
}

/******************************************************
* 函  数：指定地址写数据
* 参  数：addr指定的地址，dat要写的数据
* 返回值：无
******************************************************/
void write_IIC(uchar addr, uchar dat)
{
	start();
	IIC_write_byte(0xa0);
	ack();
	IIC_write_byte(addr);
	ack();
	IIC_write_byte(dat);
	ack();
	stop();
}

/******************************************************
* 函  数：指定地址读数据
* 参  数：addr指定的地址
* 返回值：temp读取的数据
******************************************************/
uchar read_IIC(uchar add)
{
	uchar temp;
	start();
	IIC_write_byte(0xa0);
	ack();
	IIC_write_byte(add);
	ack();
	start();
	IIC_write_byte(0xa1);
	ack();
	temp = IIC_read_byte();
	noack();
	stop();
	return temp;
}